namespace VarsWebApi.Models {
    export interface RicePlantingField {
        /**ตั้งอยู่ที่ใด (จังหวัด อำเภอ ตำบล) */
        Location: Location;

        /**ขนาดพื้นที่เท่าไร กี่ไร่ กี่งาน กี่ตางรางวา */
        Area: Area;
        /**ในรอบ 12 เดือนที่ผ่านมาใช้พื้นที่นี้ท้านากี่ครั้ง  */
        PlantingCount: number;
        /**
         * แต่ละครั้งท้ากี่ไร่ ท้าทั้งแปลงทุกครั้งหรือไม่ ถ้าใช่เลือก 
         * @remarks  
         * 1. ทำทั้งแปลงทุกครั้ง
         * 2. ไม่ได้ทำทั้งแปลง แต่ทำเท่ากันทุกครั้ง (-- พื้นที่เท่ากันทุกครั้ง)
         * 3. ไม่ได้ทำทั้งแปลง และทำไม่เท่ากันทุกครั้ง
         */
        PlantingArea: PlantingArea;
        /**พื้นที่เป็น ไร่ งาน ตารางวา ที่ใช้ปลูกในแต่ละครั้ง (ถ้าเลือกข้อ 2 คือ 1 ครั้ง) */
        AreaUsed: Area[];
        /**ข้อมูลการทำนาแต่ละครั้ง */
        Harvests: RicePlantingHarvest[];
        /**นาแปลงนี้ตั้งอยู่ในเขตชลประทานหรือไม่  */
        IrrigationField: boolean;
        /**ที่แปลงนี้ใช้น้้าจากแหล่งใดบ้าง   */
        WaterSources: WaterSources;
    }
}