namespace VarsWebApi.Models {
    /**ปริมาณน้้าประปาที่ใช้เฉลี่ยเดือนละเท่าไร  */
    export interface PlumbingUsage {

        /**
         * ปริมาณน้้าประปาที่ใช้เฉลี่ยเดือนละเท่าไร 
         * @remarks  
         * 1.ทราบปริมาณน้้า
         * 2.ไม่ทราบปริมาณน้้า แต่ทราบค่าน้้า
         * 3.ไม่ทราบปริมาณน้้าและค่าน้้าเนื่องจากไม่มีมิเตอร์แยกจากส่วนกลาง
         * 4.ไม่ทราบปริมาณน้้าและค่าน้้าเนื่องจากได้รับการยกเว้น   
         */
        WaterQuantity: WaterQuantity;
        /**ปริมาณน้ำ ลบ.ม./เดือน   */
        CubicMeterPerMonth: number;

        /**ทราบค่าน้้า */
        WaterBill: number;

    }
}